---
type: SymbolTypeId
namespace: Autodesk.Revit.DB
version: 2024
members: 367
tags: [revit-api, class]
---

# SymbolTypeId

`Autodesk.Revit.DB.SymbolTypeId` · Revit 2024 · 367 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Acres | 2021 | `public static ForgeTypeId Acres { get ; }` |
| Property | Ampere | 2021 | `public static ForgeTypeId Ampere { get ; }` |
| Property | Atm | 2021 | `public static ForgeTypeId Atm { get ; }` |
| Property | Baht | 2021 | `public static ForgeTypeId Baht { get ; }` |
| Property | Bar | 2021 | `public static ForgeTypeId Bar { get ; }` |
| Property | Btu | 2021 | `public static ForgeTypeId Btu { get ; }` |
| Property | BtuPerDegreeF | 2021 | `public static ForgeTypeId BtuPerDegreeF { get ; }` |
| Property | BtuPerFtSup2DegreeF | 2021 | `public static ForgeTypeId BtuPerFtSup2DegreeF { get ; }` |
| Property | BtuPerH | 2021 | `public static ForgeTypeId BtuPerH { get ; }` |
| Property | BtuPerHFtDegreeF | 2021 | `public static ForgeTypeId BtuPerHFtDegreeF { get ; }` |
| Property | BtuPerHFtSup2 | 2021 | `public static ForgeTypeId BtuPerHFtSup2 { get ; }` |
| Property | BtuPerHFtSup2DegreeF | 2021 | `public static ForgeTypeId BtuPerHFtSup2DegreeF { get ; }` |
| Property | BtuPerHFtSup3 | 2021 | `public static ForgeTypeId BtuPerHFtSup3 { get ; }` |
| Property | BtuPerLb | 2021 | `public static ForgeTypeId BtuPerLb { get ; }` |
| Property | BtuPerLbDegreeF | 2021 | `public static ForgeTypeId BtuPerLbDegreeF { get ; }` |
| Property | BtuPerS | 2021 | `public static ForgeTypeId BtuPerS { get ; }` |
| Property | CP | 2021 | `public static ForgeTypeId CP { get ; }` |
| Property | Cal | 2021 | `public static ForgeTypeId Cal { get ; }` |
| Property | CalPerS | 2021 | `public static ForgeTypeId CalPerS { get ; }` |
| Property | Cd | 2021 | `public static ForgeTypeId Cd { get ; }` |
| Property | CdPerFtSup2 | 2021 | `public static ForgeTypeId CdPerFtSup2 { get ; }` |
| Property | CdPerMSup2 | 2021 | `public static ForgeTypeId CdPerMSup2 { get ; }` |
| Property | Cf | 2021 | `public static ForgeTypeId Cf { get ; }` |
| Property | Cfh | 2021 | `public static ForgeTypeId Cfh { get ; }` |
| Property | Cfm | 2021 | `public static ForgeTypeId Cfm { get ; }` |
| Property | CfmPerCf | 2021 | `public static ForgeTypeId CfmPerCf { get ; }` |
| Property | CfmPerFtSup2 | 2021 | `public static ForgeTypeId CfmPerFtSup2 { get ; }` |
| Property | CfmPerFtSup3 | 2021 | `public static ForgeTypeId CfmPerFtSup3 { get ; }` |
| Property | CfmPerSf | 2021 | `public static ForgeTypeId CfmPerSf { get ; }` |
| Property | CfmPerTon | 2021 | `public static ForgeTypeId CfmPerTon { get ; }` |
| Property | ChineseHongKongDollar | 2021 | `public static ForgeTypeId ChineseHongKongDollar { get ; }` |
| Property | Cm | 2021 | `public static ForgeTypeId Cm { get ; }` |
| Property | CmCaret2 | 2021 | `public static ForgeTypeId CmCaret2 { get ; }` |
| Property | CmCaret3 | 2021 | `public static ForgeTypeId CmCaret3 { get ; }` |
| Property | CmPerMin | 2021 | `public static ForgeTypeId CmPerMin { get ; }` |
| Property | CmSup2 | 2021 | `public static ForgeTypeId CmSup2 { get ; }` |
| Property | CmSup2PerM | 2021 | `public static ForgeTypeId CmSup2PerM { get ; }` |
| Property | CmSup3 | 2021 | `public static ForgeTypeId CmSup3 { get ; }` |
| Property | CmSup4 | 2021 | `public static ForgeTypeId CmSup4 { get ; }` |
| Property | CmSup6 | 2021 | `public static ForgeTypeId CmSup6 { get ; }` |
| Property | Cmh | 2021 | `public static ForgeTypeId Cmh { get ; }` |
| Property | Cms | 2021 | `public static ForgeTypeId Cms { get ; }` |
| Property | Colon1 | 2021 | `public static ForgeTypeId Colon1 { get ; }` |
| Property | Colon10 | 2021 | `public static ForgeTypeId Colon10 { get ; }` |
| Property | Colon12 | 2021 | `public static ForgeTypeId Colon12 { get ; }` |
| Property | Cps | 2021 | `public static ForgeTypeId Cps { get ; }` |
| Property | Custom | 2021 | `public static ForgeTypeId Custom { get ; }` |
| Property | Cy | 2021 | `public static ForgeTypeId Cy { get ; }` |
| Property | DaN | 2021 | `public static ForgeTypeId DaN { get ; }` |
| Property | DaNDashM | 2021 | `public static ForgeTypeId DaNDashM { get ; }` |
| Property | DaNDashMPerM | 2021 | `public static ForgeTypeId DaNDashMPerM { get ; }` |
| Property | DaNPerM | 2021 | `public static ForgeTypeId DaNPerM { get ; }` |
| Property | DaNPerMSup2 | 2021 | `public static ForgeTypeId DaNPerMSup2 { get ; }` |
| Property | Degree | 2021 | `public static ForgeTypeId Degree { get ; }` |
| Property | DegreeC | 2021 | `public static ForgeTypeId DegreeC { get ; }` |
| Property | DegreeCInterval | 2021 | `public static ForgeTypeId DegreeCInterval { get ; }` |
| Property | DegreeF | 2021 | `public static ForgeTypeId DegreeF { get ; }` |
| Property | DegreeFInterval | 2021 | `public static ForgeTypeId DegreeFInterval { get ; }` |
| Property | DegreeR | 2021 | `public static ForgeTypeId DegreeR { get ; }` |
| Property | DegreeRInterval | 2021 | `public static ForgeTypeId DegreeRInterval { get ; }` |
| Property | DeltaDegreeC | 2021 | `public static ForgeTypeId DeltaDegreeC { get ; }` |
| Property | DeltaDegreeF | 2021 | `public static ForgeTypeId DeltaDegreeF { get ; }` |
| Property | DeltaDegreeR | 2021 | `public static ForgeTypeId DeltaDegreeR { get ; }` |
| Property | DeltaK | 2021 | `public static ForgeTypeId DeltaK { get ; }` |
| Property | Dm | 2021 | `public static ForgeTypeId Dm { get ; }` |
| Property | DollarHPerBtu | 2021 | `public static ForgeTypeId DollarHPerBtu { get ; }` |
| Property | DollarPerBtu | 2021 | `public static ForgeTypeId DollarPerBtu { get ; }` |
| Property | DollarPerFtSup2 | 2021 | `public static ForgeTypeId DollarPerFtSup2 { get ; }` |
| Property | DollarPerMSup2 | 2021 | `public static ForgeTypeId DollarPerMSup2 { get ; }` |
| Property | DollarPerW | 2021 | `public static ForgeTypeId DollarPerW { get ; }` |
| Property | DollarPerWH | 2021 | `public static ForgeTypeId DollarPerWH { get ; }` |
| Property | Dong | 2021 | `public static ForgeTypeId Dong { get ; }` |
| Property | EuroPrefix | 2021 | `public static ForgeTypeId EuroPrefix { get ; }` |
| Property | EuroSuffix | 2021 | `public static ForgeTypeId EuroSuffix { get ; }` |
| Property | FL | 2021 | `public static ForgeTypeId FL { get ; }` |
| Property | Fc | 2021 | `public static ForgeTypeId Fc { get ; }` |
| Property | FeetOfWater | 2021 | `public static ForgeTypeId FeetOfWater { get ; }` |
| Property | FeetOfWaterPer100ft | 2021 | `public static ForgeTypeId FeetOfWaterPer100ft { get ; }` |
| Property | FlLowercase | 2021 | `public static ForgeTypeId FlLowercase { get ; }` |
| Property | FootSingleQuote | 2021 | `public static ForgeTypeId FootSingleQuote { get ; }` |
| Property | Fpm | 2021 | `public static ForgeTypeId Fpm { get ; }` |
| Property | Fps | 2021 | `public static ForgeTypeId Fps { get ; }` |
| Property | Ft | 2021 | `public static ForgeTypeId Ft { get ; }` |
| Property | FtCaret2 | 2021 | `public static ForgeTypeId FtCaret2 { get ; }` |
| Property | FtCaret3 | 2021 | `public static ForgeTypeId FtCaret3 { get ; }` |
| Property | FtH2O | 2021 | `public static ForgeTypeId FtH2O { get ; }` |
| Property | FtH2OPer100ft | 2021 | `public static ForgeTypeId FtH2OPer100ft { get ; }` |
| Property | FtL | 2021 | `public static ForgeTypeId FtL { get ; }` |
| Property | FtOfWater | 2021 | `public static ForgeTypeId FtOfWater { get ; }` |
| Property | FtOfWaterPer100ft | 2021 | `public static ForgeTypeId FtOfWaterPer100ft { get ; }` |
| Property | FtPerKip | 2021 | `public static ForgeTypeId FtPerKip { get ; }` |
| Property | FtPerMin | 2021 | `public static ForgeTypeId FtPerMin { get ; }` |
| Property | FtPerS | 2021 | `public static ForgeTypeId FtPerS { get ; }` |
| Property | FtPerSSup2 | 2021 | `public static ForgeTypeId FtPerSSup2 { get ; }` |
| Property | FtSup2 | 2021 | `public static ForgeTypeId FtSup2 { get ; }` |
| Property | FtSup2HPerKbtu | 2021 | `public static ForgeTypeId FtSup2HPerKbtu { get ; }` |
| Property | FtSup2PerFt | 2021 | `public static ForgeTypeId FtSup2PerFt { get ; }` |
| Property | FtSup2PerKip | 2021 | `public static ForgeTypeId FtSup2PerKip { get ; }` |
| Property | FtSup2PerMbh | 2021 | `public static ForgeTypeId FtSup2PerMbh { get ; }` |
| Property | FtSup2PerS | 2021 | `public static ForgeTypeId FtSup2PerS { get ; }` |
| Property | FtSup2PerTon | 2021 | `public static ForgeTypeId FtSup2PerTon { get ; }` |
| Property | FtSup3 | 2021 | `public static ForgeTypeId FtSup3 { get ; }` |
| Property | FtSup3HPerMinBtu | 2021 | `public static ForgeTypeId FtSup3HPerMinBtu { get ; }` |
| Property | FtSup3PerH | 2021 | `public static ForgeTypeId FtSup3PerH { get ; }` |
| Property | FtSup3PerKip | 2021 | `public static ForgeTypeId FtSup3PerKip { get ; }` |
| Property | FtSup3PerLbMass | 2021 | `public static ForgeTypeId FtSup3PerLbMass { get ; }` |
| Property | FtSup3PerMin | 2021 | `public static ForgeTypeId FtSup3PerMin { get ; }` |
| Property | FtSup4 | 2021 | `public static ForgeTypeId FtSup4 { get ; }` |
| Property | FtSup6 | 2021 | `public static ForgeTypeId FtSup6 { get ; }` |
| Property | Ftc | 2021 | `public static ForgeTypeId Ftc { get ; }` |
| Property | Gal | 2021 | `public static ForgeTypeId Gal { get ; }` |
| Property | GalPerH | 2021 | `public static ForgeTypeId GalPerH { get ; }` |
| Property | GalPerMin | 2021 | `public static ForgeTypeId GalPerMin { get ; }` |
| Property | Gph | 2021 | `public static ForgeTypeId Gph { get ; }` |
| Property | Gpm | 2021 | `public static ForgeTypeId Gpm { get ; }` |
| Property | GrPerHFtSup2InHg | 2021 | `public static ForgeTypeId GrPerHFtSup2InHg { get ; }` |
| Property | Grad | 2021 | `public static ForgeTypeId Grad { get ; }` |
| Property | HFtSup2DegreeFPerBtu | 2021 | `public static ForgeTypeId HFtSup2DegreeFPerBtu { get ; }` |
| Property | Hectare | 2021 | `public static ForgeTypeId Hectare { get ; }` |
| Property | Hour | 2021 | `public static ForgeTypeId Hour { get ; }` |
| Property | Hp | 2021 | `public static ForgeTypeId Hp { get ; }` |
| Property | Hz | 2021 | `public static ForgeTypeId Hz { get ; }` |
| Property | In | 2021 | `public static ForgeTypeId In { get ; }` |
| Property | InCaret2 | 2021 | `public static ForgeTypeId InCaret2 { get ; }` |
| Property | InCaret3 | 2021 | `public static ForgeTypeId InCaret3 { get ; }` |
| Property | InDashWg | 2021 | `public static ForgeTypeId InDashWg { get ; }` |
| Property | InDashWgPer100ft | 2021 | `public static ForgeTypeId InDashWgPer100ft { get ; }` |
| Property | InHg | 2021 | `public static ForgeTypeId InHg { get ; }` |
| Property | InPerSSup2 | 2021 | `public static ForgeTypeId InPerSSup2 { get ; }` |
| Property | InSup2 | 2021 | `public static ForgeTypeId InSup2 { get ; }` |
| Property | InSup2PerFt | 2021 | `public static ForgeTypeId InSup2PerFt { get ; }` |
| Property | InSup3 | 2021 | `public static ForgeTypeId InSup3 { get ; }` |
| Property | InSup4 | 2021 | `public static ForgeTypeId InSup4 { get ; }` |
| Property | InSup6 | 2021 | `public static ForgeTypeId InSup6 { get ; }` |
| Property | InchDoubleQuote | 2021 | `public static ForgeTypeId InchDoubleQuote { get ; }` |
| Property | InvDegreeC | 2021 | `public static ForgeTypeId InvDegreeC { get ; }` |
| Property | InvDegreeF | 2021 | `public static ForgeTypeId InvDegreeF { get ; }` |
| Property | InvKN | 2021 | `public static ForgeTypeId InvKN { get ; }` |
| Property | InvKip | 2021 | `public static ForgeTypeId InvKip { get ; }` |
| Property | JPerG | 2021 | `public static ForgeTypeId JPerG { get ; }` |
| Property | JPerGDegreeC | 2021 | `public static ForgeTypeId JPerGDegreeC { get ; }` |
| Property | JPerK | 2021 | `public static ForgeTypeId JPerK { get ; }` |
| Property | JPerKgDegreeC | 2021 | `public static ForgeTypeId JPerKgDegreeC { get ; }` |
| Property | JPerMSup2K | 2021 | `public static ForgeTypeId JPerMSup2K { get ; }` |
| Property | Joule | 2021 | `public static ForgeTypeId Joule { get ; }` |
| Property | KA | 2021 | `public static ForgeTypeId KA { get ; }` |
| Property | KJ | 2021 | `public static ForgeTypeId KJ { get ; }` |
| Property | KJPerK | 2021 | `public static ForgeTypeId KJPerK { get ; }` |
| Property | KJPerMSup2K | 2021 | `public static ForgeTypeId KJPerMSup2K { get ; }` |
| Property | KN | 2021 | `public static ForgeTypeId KN { get ; }` |
| Property | KNDashM | 2021 | `public static ForgeTypeId KNDashM { get ; }` |
| Property | KNDashMPerDegree | 2021 | `public static ForgeTypeId KNDashMPerDegree { get ; }` |
| Property | KNDashMPerDegreePerM | 2021 | `public static ForgeTypeId KNDashMPerDegreePerM { get ; }` |
| Property | KNDashMPerM | 2021 | `public static ForgeTypeId KNDashMPerM { get ; }` |
| Property | KNPerCmSup2 | 2021 | `public static ForgeTypeId KNPerCmSup2 { get ; }` |
| Property | KNPerM | 2021 | `public static ForgeTypeId KNPerM { get ; }` |
| Property | KNPerMSup2 | 2021 | `public static ForgeTypeId KNPerMSup2 { get ; }` |
| Property | KNPerMSup3 | 2021 | `public static ForgeTypeId KNPerMSup3 { get ; }` |
| Property | KNPerMmSup2 | 2021 | `public static ForgeTypeId KNPerMmSup2 { get ; }` |
| Property | KPa | 2021 | `public static ForgeTypeId KPa { get ; }` |
| Property | KV | 2021 | `public static ForgeTypeId KV { get ; }` |
| Property | KVA | 2021 | `public static ForgeTypeId KVA { get ; }` |
| Property | KW | 2021 | `public static ForgeTypeId KW { get ; }` |
| Property | KWh | 2021 | `public static ForgeTypeId KWh { get ; }` |
| Property | Kcal | 2021 | `public static ForgeTypeId Kcal { get ; }` |
| Property | KcalPerS | 2021 | `public static ForgeTypeId KcalPerS { get ; }` |
| Property | Kelvin | 2021 | `public static ForgeTypeId Kelvin { get ; }` |
| Property | KelvinInterval | 2021 | `public static ForgeTypeId KelvinInterval { get ; }` |
| Property | Kg | 2021 | `public static ForgeTypeId Kg { get ; }` |
| Property | KgPerH | 2021 | `public static ForgeTypeId KgPerH { get ; }` |
| Property | KgPerKgK | 2021 | `public static ForgeTypeId KgPerKgK { get ; }` |
| Property | KgPerM | 2021 | `public static ForgeTypeId KgPerM { get ; }` |
| Property | KgPerMH | 2021 | `public static ForgeTypeId KgPerMH { get ; }` |
| Property | KgPerMS | 2021 | `public static ForgeTypeId KgPerMS { get ; }` |
| Property | KgPerMSup2 | 2021 | `public static ForgeTypeId KgPerMSup2 { get ; }` |
| Property | KgPerMSup3 | 2021 | `public static ForgeTypeId KgPerMSup3 { get ; }` |
| Property | KgPerMin | 2021 | `public static ForgeTypeId KgPerMin { get ; }` |
| Property | KgPerS | 2021 | `public static ForgeTypeId KgPerS { get ; }` |
| Property | Kgf | 2021 | `public static ForgeTypeId Kgf { get ; }` |
| Property | KgfDashM | 2021 | `public static ForgeTypeId KgfDashM { get ; }` |
| Property | KgfDashMPerM | 2021 | `public static ForgeTypeId KgfDashMPerM { get ; }` |
| Property | KgfPerM | 2021 | `public static ForgeTypeId KgfPerM { get ; }` |
| Property | KgfPerMSup2 | 2021 | `public static ForgeTypeId KgfPerMSup2 { get ; }` |
| Property | Kip | 2021 | `public static ForgeTypeId Kip { get ; }` |
| Property | KipDashFt | 2021 | `public static ForgeTypeId KipDashFt { get ; }` |
| Property | KipDashFtPerDegree | 2021 | `public static ForgeTypeId KipDashFtPerDegree { get ; }` |
| Property | KipDashFtPerDegreePerFt | 2021 | `public static ForgeTypeId KipDashFtPerDegreePerFt { get ; }` |
| Property | KipDashFtPerFt | 2021 | `public static ForgeTypeId KipDashFtPerFt { get ; }` |
| Property | KipPerFt | 2021 | `public static ForgeTypeId KipPerFt { get ; }` |
| Property | KipPerFtSup2 | 2021 | `public static ForgeTypeId KipPerFtSup2 { get ; }` |
| Property | KipPerFtSup3 | 2021 | `public static ForgeTypeId KipPerFtSup3 { get ; }` |
| Property | KipPerIn | 2021 | `public static ForgeTypeId KipPerIn { get ; }` |
| Property | KipPerInSup2 | 2021 | `public static ForgeTypeId KipPerInSup2 { get ; }` |
| Property | KipPerInSup3 | 2021 | `public static ForgeTypeId KipPerInSup3 { get ; }` |
| Property | KmPerH | 2021 | `public static ForgeTypeId KmPerH { get ; }` |
| Property | KmPerSSup2 | 2021 | `public static ForgeTypeId KmPerSSup2 { get ; }` |
| Property | Krone | 2021 | `public static ForgeTypeId Krone { get ; }` |
| Property | Ksf | 2021 | `public static ForgeTypeId Ksf { get ; }` |
| Property | Ksi | 2021 | `public static ForgeTypeId Ksi { get ; }` |
| Property | LPerH | 2021 | `public static ForgeTypeId LPerH { get ; }` |
| Property | LPerMin | 2021 | `public static ForgeTypeId LPerMin { get ; }` |
| Property | LPerS | 2021 | `public static ForgeTypeId LPerS { get ; }` |
| Property | LPerSKw | 2021 | `public static ForgeTypeId LPerSKw { get ; }` |
| Property | LPerSMSup2 | 2021 | `public static ForgeTypeId LPerSMSup2 { get ; }` |
| Property | LPerSMSup3 | 2021 | `public static ForgeTypeId LPerSMSup3 { get ; }` |
| Property | LbForce | 2021 | `public static ForgeTypeId LbForce { get ; }` |
| Property | LbForceDashFt | 2021 | `public static ForgeTypeId LbForceDashFt { get ; }` |
| Property | LbForceDashFtPerFt | 2021 | `public static ForgeTypeId LbForceDashFtPerFt { get ; }` |
| Property | LbForcePerFt | 2021 | `public static ForgeTypeId LbForcePerFt { get ; }` |
| Property | LbForcePerFtSup2 | 2021 | `public static ForgeTypeId LbForcePerFtSup2 { get ; }` |
| Property | LbForcePerFtSup3 | 2021 | `public static ForgeTypeId LbForcePerFtSup3 { get ; }` |
| Property | LbForcePerInSup2 | 2021 | `public static ForgeTypeId LbForcePerInSup2 { get ; }` |
| Property | LbForceSPerFtSup2 | 2021 | `public static ForgeTypeId LbForceSPerFtSup2 { get ; }` |
| Property | LbMass | 2021 | `public static ForgeTypeId LbMass { get ; }` |
| Property | LbMassPerFt | 2021 | `public static ForgeTypeId LbMassPerFt { get ; }` |
| Property | LbMassPerFtDashH | 2021 | `public static ForgeTypeId LbMassPerFtDashH { get ; }` |
| Property | LbMassPerFtDashS | 2021 | `public static ForgeTypeId LbMassPerFtDashS { get ; }` |
| Property | LbMassPerFtSup2 | 2021 | `public static ForgeTypeId LbMassPerFtSup2 { get ; }` |
| Property | LbMassPerFtSup3 | 2021 | `public static ForgeTypeId LbMassPerFtSup3 { get ; }` |
| Property | LbMassPerH | 2021 | `public static ForgeTypeId LbMassPerH { get ; }` |
| Property | LbMassPerInSup3 | 2021 | `public static ForgeTypeId LbMassPerInSup3 { get ; }` |
| Property | LbMassPerLbDegreeF | 2021 | `public static ForgeTypeId LbMassPerLbDegreeF { get ; }` |
| Property | LbMassPerMin | 2021 | `public static ForgeTypeId LbMassPerMin { get ; }` |
| Property | LbMassPerS | 2021 | `public static ForgeTypeId LbMassPerS { get ; }` |
| Property | Lbf | 2021 | `public static ForgeTypeId Lbf { get ; }` |
| Property | LbfDashFt | 2021 | `public static ForgeTypeId LbfDashFt { get ; }` |
| Property | LbfDashFtPerFt | 2021 | `public static ForgeTypeId LbfDashFtPerFt { get ; }` |
| Property | LbfPerFt | 2021 | `public static ForgeTypeId LbfPerFt { get ; }` |
| Property | LbfPerFtSup2 | 2021 | `public static ForgeTypeId LbfPerFtSup2 { get ; }` |
| Property | LbfPerFtSup3 | 2021 | `public static ForgeTypeId LbfPerFtSup3 { get ; }` |
| Property | LbfPerInSup2 | 2021 | `public static ForgeTypeId LbfPerInSup2 { get ; }` |
| Property | Lbm | 2021 | `public static ForgeTypeId Lbm { get ; }` |
| Property | LbmPerFt | 2021 | `public static ForgeTypeId LbmPerFt { get ; }` |
| Property | LbmPerFtDashH | 2021 | `public static ForgeTypeId LbmPerFtDashH { get ; }` |
| Property | LbmPerFtDashS | 2021 | `public static ForgeTypeId LbmPerFtDashS { get ; }` |
| Property | LbmPerFtSup3 | 2021 | `public static ForgeTypeId LbmPerFtSup3 { get ; }` |
| Property | LbmPerInSup3 | 2021 | `public static ForgeTypeId LbmPerInSup3 { get ; }` |
| Property | Lf | 2021 | `public static ForgeTypeId Lf { get ; }` |
| Property | Liter | 2021 | `public static ForgeTypeId Liter { get ; }` |
| Property | Lm | 2021 | `public static ForgeTypeId Lm { get ; }` |
| Property | LmPerW | 2021 | `public static ForgeTypeId LmPerW { get ; }` |
| Property | Lpm | 2021 | `public static ForgeTypeId Lpm { get ; }` |
| Property | Lps | 2021 | `public static ForgeTypeId Lps { get ; }` |
| Property | LpsPerMSup2 | 2021 | `public static ForgeTypeId LpsPerMSup2 { get ; }` |
| Property | Lx | 2021 | `public static ForgeTypeId Lx { get ; }` |
| Property | MA | 2021 | `public static ForgeTypeId MA { get ; }` |
| Property | MCaret2 | 2021 | `public static ForgeTypeId MCaret2 { get ; }` |
| Property | MCaret3 | 2021 | `public static ForgeTypeId MCaret3 { get ; }` |
| Property | MH2O | 2021 | `public static ForgeTypeId MH2O { get ; }` |
| Property | MH2OPerM | 2021 | `public static ForgeTypeId MH2OPerM { get ; }` |
| Property | MN | 2021 | `public static ForgeTypeId MN { get ; }` |
| Property | MNDashM | 2021 | `public static ForgeTypeId MNDashM { get ; }` |
| Property | MNDashMPerM | 2021 | `public static ForgeTypeId MNDashMPerM { get ; }` |
| Property | MNPerM | 2021 | `public static ForgeTypeId MNPerM { get ; }` |
| Property | MNPerMSup2 | 2021 | `public static ForgeTypeId MNPerMSup2 { get ; }` |
| Property | MPa | 2021 | `public static ForgeTypeId MPa { get ; }` |
| Property | MPerKN | 2021 | `public static ForgeTypeId MPerKN { get ; }` |
| Property | MPerS | 2021 | `public static ForgeTypeId MPerS { get ; }` |
| Property | MPerSSup2 | 2021 | `public static ForgeTypeId MPerSSup2 { get ; }` |
| Property | MSup2 | 2021 | `public static ForgeTypeId MSup2 { get ; }` |
| Property | MSup2KPerW | 2021 | `public static ForgeTypeId MSup2KPerW { get ; }` |
| Property | MSup2PerKN | 2021 | `public static ForgeTypeId MSup2PerKN { get ; }` |
| Property | MSup2PerKw | 2021 | `public static ForgeTypeId MSup2PerKw { get ; }` |
| Property | MSup2PerM | 2021 | `public static ForgeTypeId MSup2PerM { get ; }` |
| Property | MSup2PerS | 2021 | `public static ForgeTypeId MSup2PerS { get ; }` |
| Property | MSup3 | 2021 | `public static ForgeTypeId MSup3 { get ; }` |
| Property | MSup3PerH | 2021 | `public static ForgeTypeId MSup3PerH { get ; }` |
| Property | MSup3PerHMSup2 | 2021 | `public static ForgeTypeId MSup3PerHMSup2 { get ; }` |
| Property | MSup3PerHMSup3 | 2021 | `public static ForgeTypeId MSup3PerHMSup3 { get ; }` |
| Property | MSup3PerKN | 2021 | `public static ForgeTypeId MSup3PerKN { get ; }` |
| Property | MSup3PerKg | 2021 | `public static ForgeTypeId MSup3PerKg { get ; }` |
| Property | MSup3PerS | 2021 | `public static ForgeTypeId MSup3PerS { get ; }` |
| Property | MSup3PerWS | 2021 | `public static ForgeTypeId MSup3PerWS { get ; }` |
| Property | MSup4 | 2021 | `public static ForgeTypeId MSup4 { get ; }` |
| Property | MSup6 | 2021 | `public static ForgeTypeId MSup6 { get ; }` |
| Property | MV | 2021 | `public static ForgeTypeId MV { get ; }` |
| Property | Mbh | 2021 | `public static ForgeTypeId Mbh { get ; }` |
| Property | Meter | 2021 | `public static ForgeTypeId Meter { get ; }` |
| Property | MiPerSSup2 | 2021 | `public static ForgeTypeId MiPerSSup2 { get ; }` |
| Property | Min | 2021 | `public static ForgeTypeId Min { get ; }` |
| Property | Mm | 2021 | `public static ForgeTypeId Mm { get ; }` |
| Property | MmCaret2 | 2021 | `public static ForgeTypeId MmCaret2 { get ; }` |
| Property | MmCaret3 | 2021 | `public static ForgeTypeId MmCaret3 { get ; }` |
| Property | MmH2O | 2021 | `public static ForgeTypeId MmH2O { get ; }` |
| Property | MmH2OPerM | 2021 | `public static ForgeTypeId MmH2OPerM { get ; }` |
| Property | MmHg | 2021 | `public static ForgeTypeId MmHg { get ; }` |
| Property | MmSup2 | 2021 | `public static ForgeTypeId MmSup2 { get ; }` |
| Property | MmSup2PerM | 2021 | `public static ForgeTypeId MmSup2PerM { get ; }` |
| Property | MmSup3 | 2021 | `public static ForgeTypeId MmSup3 { get ; }` |
| Property | MmSup4 | 2021 | `public static ForgeTypeId MmSup4 { get ; }` |
| Property | MmSup6 | 2021 | `public static ForgeTypeId MmSup6 { get ; }` |
| Property | Mph | 2021 | `public static ForgeTypeId Mph { get ; }` |
| Property | Ms | 2021 | `public static ForgeTypeId Ms { get ; }` |
| Property | NDashM | 2021 | `public static ForgeTypeId NDashM { get ; }` |
| Property | NDashMPerM | 2021 | `public static ForgeTypeId NDashMPerM { get ; }` |
| Property | NPerM | 2021 | `public static ForgeTypeId NPerM { get ; }` |
| Property | NPerMSup2 | 2021 | `public static ForgeTypeId NPerMSup2 { get ; }` |
| Property | NPerMmSup2 | 2021 | `public static ForgeTypeId NPerMmSup2 { get ; }` |
| Property | NSPerMSup2 | 2021 | `public static ForgeTypeId NSPerMSup2 { get ; }` |
| Property | Newton | 2021 | `public static ForgeTypeId Newton { get ; }` |
| Property | NgPerPaSMSup2 | 2021 | `public static ForgeTypeId NgPerPaSMSup2 { get ; }` |
| Property | OhmM | 2021 | `public static ForgeTypeId OhmM { get ; }` |
| Property | OneColon | 2021 | `public static ForgeTypeId OneColon { get ; }` |
| Property | Pa | 2021 | `public static ForgeTypeId Pa { get ; }` |
| Property | PaDashS | 2021 | `public static ForgeTypeId PaDashS { get ; }` |
| Property | PaPerM | 2021 | `public static ForgeTypeId PaPerM { get ; }` |
| Property | PerMille | 2021 | `public static ForgeTypeId PerMille { get ; }` |
| Property | Percent | 2021 | `public static ForgeTypeId Percent { get ; }` |
| Property | Pi | 2021 | `public static ForgeTypeId Pi { get ; }` |
| Property | Psf | 2021 | `public static ForgeTypeId Psf { get ; }` |
| Property | Psi | 2021 | `public static ForgeTypeId Psi { get ; }` |
| Property | Psia | 2021 | `public static ForgeTypeId Psia { get ; }` |
| Property | Psig | 2021 | `public static ForgeTypeId Psig { get ; }` |
| Property | Rad | 2021 | `public static ForgeTypeId Rad { get ; }` |
| Property | RadPerS | 2021 | `public static ForgeTypeId RadPerS { get ; }` |
| Property | Rpm | 2021 | `public static ForgeTypeId Rpm { get ; }` |
| Property | Rps | 2021 | `public static ForgeTypeId Rps { get ; }` |
| Property | Second | 2021 | `public static ForgeTypeId Second { get ; }` |
| Property | Sf | 2021 | `public static ForgeTypeId Sf { get ; }` |
| Property | SfHPerKbtu | 2021 | `public static ForgeTypeId SfHPerKbtu { get ; }` |
| Property | SfPerMbh | 2021 | `public static ForgeTypeId SfPerMbh { get ; }` |
| Property | SfPerTon | 2021 | `public static ForgeTypeId SfPerTon { get ; }` |
| Property | Shekel | 2021 | `public static ForgeTypeId Shekel { get ; }` |
| Property | SlopeDegree | 2021 | `public static ForgeTypeId SlopeDegree { get ; }` |
| Property | Stf | 2021 | `public static ForgeTypeId Stf { get ; }` |
| Property | Tf | 2021 | `public static ForgeTypeId Tf { get ; }` |
| Property | TfDashM | 2021 | `public static ForgeTypeId TfDashM { get ; }` |
| Property | TfDashMPerM | 2021 | `public static ForgeTypeId TfDashMPerM { get ; }` |
| Property | TfPerM | 2021 | `public static ForgeTypeId TfPerM { get ; }` |
| Property | TfPerMSup2 | 2021 | `public static ForgeTypeId TfPerMSup2 { get ; }` |
| Property | Therm | 2021 | `public static ForgeTypeId Therm { get ; }` |
| Property | Ton | 2021 | `public static ForgeTypeId Ton { get ; }` |
| Property | TonOfRefrigeration | 2021 | `public static ForgeTypeId TonOfRefrigeration { get ; }` |
| Property | Tonne | 2021 | `public static ForgeTypeId Tonne { get ; }` |
| Property | Tonsf | 2021 | `public static ForgeTypeId Tonsf { get ; }` |
| Property | UinPerInDegreeF | 2021 | `public static ForgeTypeId UinPerInDegreeF { get ; }` |
| Property | UkPound | 2021 | `public static ForgeTypeId UkPound { get ; }` |
| Property | UmPerMDegreeC | 2021 | `public static ForgeTypeId UmPerMDegreeC { get ; }` |
| Property | UsDollar | 2021 | `public static ForgeTypeId UsDollar { get ; }` |
| Property | UsTonnesForceSt | 2021 | `public static ForgeTypeId UsTonnesForceSt { get ; }` |
| Property | UsTonnesForceT | 2021 | `public static ForgeTypeId UsTonnesForceT { get ; }` |
| Property | UsTonnesForceTons | 2021 | `public static ForgeTypeId UsTonnesForceTons { get ; }` |
| Property | UsTonnesMassSt | 2021 | `public static ForgeTypeId UsTonnesMassSt { get ; }` |
| Property | UsTonnesMassT | 2021 | `public static ForgeTypeId UsTonnesMassT { get ; }` |
| Property | UsTonnesMassTons | 2021 | `public static ForgeTypeId UsTonnesMassTons { get ; }` |
| Property | Usft | 2021 | `public static ForgeTypeId Usft { get ; }` |
| Property | Usgph | 2021 | `public static ForgeTypeId Usgph { get ; }` |
| Property | Usgpm | 2021 | `public static ForgeTypeId Usgpm { get ; }` |
| Property | VA | 2021 | `public static ForgeTypeId VA { get ; }` |
| Property | VAPerFtSup2 | 2021 | `public static ForgeTypeId VAPerFtSup2 { get ; }` |
| Property | VAPerMSup2 | 2021 | `public static ForgeTypeId VAPerMSup2 { get ; }` |
| Property | Volt | 2021 | `public static ForgeTypeId Volt { get ; }` |
| Property | WMinPerFtSup3 | 2021 | `public static ForgeTypeId WMinPerFtSup3 { get ; }` |
| Property | WPerFt | 2021 | `public static ForgeTypeId WPerFt { get ; }` |
| Property | WPerFtSup2 | 2021 | `public static ForgeTypeId WPerFtSup2 { get ; }` |
| Property | WPerFtSup3 | 2021 | `public static ForgeTypeId WPerFtSup3 { get ; }` |
| Property | WPerM | 2021 | `public static ForgeTypeId WPerM { get ; }` |
| Property | WPerMK | 2021 | `public static ForgeTypeId WPerMK { get ; }` |
| Property | WPerMSup2 | 2021 | `public static ForgeTypeId WPerMSup2 { get ; }` |
| Property | WPerMSup2K | 2021 | `public static ForgeTypeId WPerMSup2K { get ; }` |
| Property | WPerMSup3 | 2021 | `public static ForgeTypeId WPerMSup3 { get ; }` |
| Property | WSPerMSup3 | 2021 | `public static ForgeTypeId WSPerMSup3 { get ; }` |
| Property | Watt | 2021 | `public static ForgeTypeId Watt { get ; }` |
| Property | Won | 2021 | `public static ForgeTypeId Won { get ; }` |
| Property | YdCaret3 | 2021 | `public static ForgeTypeId YdCaret3 { get ; }` |
| Property | YdSup3 | 2021 | `public static ForgeTypeId YdSup3 { get ; }` |
| Property | Yen | 2021 | `public static ForgeTypeId Yen { get ; }` |